MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKE16F256VLH16/mcu.h
/* CRC - Peripheral instance base addresses */
/** Peripheral CRC base address */
#define CRC_BASE                                 (0x40032000u)
/** Peripheral CRC base pointer */
#define CRC0                                     ((CRC_Type *)CRC_BASE)
/** Array initializer of CRC peripheral base addresses */
#define CRC_BASE_ADDRS                           { CRC_BASE }
/** Array initializer of CRC peripheral base pointers */
#define CRC_BASE_PTRS                            { CRC0 }

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DAC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DAC_Peripheral_Access_Layer DAC Peripheral Access Layer
 * @{
 */

/** DAC - Register Layout Typedef */
typedef struct {
  __IO uint32_t DAT[8];                            /**< DAC Data Register, array offset: 0x0, array step: 0x4 */
  __IO uint32_t STATCTRL;                          /**< DAC Status and Control Register, offset: 0x20 */
} DAC_Type;

/* ----------------------------------------------------------------------------
   -- DAC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DAC_Register_Masks DAC Register Masks
 * @{
 */

/*! @name DAT - DAC Data Register */
/*! @{ */
#define DAC_DAT_DATA0_MASK                       (0xFFFU)
#define DAC_DAT_DATA0_SHIFT                      (0U)
#define DAC_DAT_DATA0(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_DAT_DATA0_SHIFT)) & DAC_DAT_DATA0_MASK)
#define DAC_DAT_DATA1_MASK                       (0xFFF0000U)
#define DAC_DAT_DATA1_SHIFT                      (16U)
#define DAC_DAT_DATA1(x)                         (((uint32_t)(((uint32_t)(x)) << DAC_DAT_DATA1_SHIFT)) & DAC_DAT_DATA1_MASK)
/*! @} */

/* The count of DAC_DAT */
#define DAC_DAT_COUNT                            (8U)

/*! @name STATCTRL - DAC Status and Control Register */
/*! @{ */
#define DAC_STATCTRL_DACBFRPBF_MASK              (0x1U)
#define DAC_STATCTRL_DACBFRPBF_SHIFT             (0U)
/*! DACBFRPBF - DAC Buffer Read Pointer Bottom Position Flag
 *  0b0..The DAC buffer read pointer is not equal to DACBFUP.
 *  0b1..The DAC buffer read pointer is equal to DACBFUP.
 */
#define DAC_STATCTRL_DACBFRPBF(x)                (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFRPBF_SHIFT)) & DAC_STATCTRL_DACBFRPBF_MASK)
#define DAC_STATCTRL_DACBFRPTF_MASK              (0x2U)
#define DAC_STATCTRL_DACBFRPTF_SHIFT             (1U)
/*! DACBFRPTF - DAC Buffer Read Pointer Top Position Flag
 *  0b0..The DAC buffer read pointer is not zero.
 *  0b1..The DAC buffer read pointer is zero.
 */
#define DAC_STATCTRL_DACBFRPTF(x)                (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFRPTF_SHIFT)) & DAC_STATCTRL_DACBFRPTF_MASK)
#define DAC_STATCTRL_DACBFWMF_MASK               (0x4U)
#define DAC_STATCTRL_DACBFWMF_SHIFT              (2U)
/*! DACBFWMF - DAC Buffer Watermark Flag
 *  0b0..The DAC buffer read pointer has not reached the watermark level.
 *  0b1..The DAC buffer read pointer has reached the watermark level.
 */
#define DAC_STATCTRL_DACBFWMF(x)                 (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFWMF_SHIFT)) & DAC_STATCTRL_DACBFWMF_MASK)
#define DAC_STATCTRL_DACBBIEN_MASK               (0x100U)
#define DAC_STATCTRL_DACBBIEN_SHIFT              (8U)
/*! DACBBIEN - DAC Buffer Read Pointer Bottom Flag Interrupt Enable
 *  0b0..The DAC buffer read pointer bottom flag interrupt is disabled.
 *  0b1..The DAC buffer read pointer bottom flag interrupt is enabled.
 */
#define DAC_STATCTRL_DACBBIEN(x)                 (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBBIEN_SHIFT)) & DAC_STATCTRL_DACBBIEN_MASK)
#define DAC_STATCTRL_DACBTIEN_MASK               (0x200U)
#define DAC_STATCTRL_DACBTIEN_SHIFT              (9U)
/*! DACBTIEN - DAC Buffer Read Pointer Top Flag Interrupt Enable
 *  0b0..The DAC buffer read pointer top flag interrupt is disabled.
 *  0b1..The DAC buffer read pointer top flag interrupt is enabled.
 */
#define DAC_STATCTRL_DACBTIEN(x)                 (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBTIEN_SHIFT)) & DAC_STATCTRL_DACBTIEN_MASK)
#define DAC_STATCTRL_DACBWIEN_MASK               (0x400U)
#define DAC_STATCTRL_DACBWIEN_SHIFT              (10U)
/*! DACBWIEN - DAC Buffer Watermark Interrupt Enable
 *  0b0..The DAC buffer watermark interrupt is disabled.
 *  0b1..The DAC buffer watermark interrupt is enabled.
 */
#define DAC_STATCTRL_DACBWIEN(x)                 (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBWIEN_SHIFT)) & DAC_STATCTRL_DACBWIEN_MASK)
#define DAC_STATCTRL_LPEN_MASK                   (0x800U)
#define DAC_STATCTRL_LPEN_SHIFT                  (11U)
/*! LPEN - DAC Low Power Control
 *  0b0..High-Power mode
 *  0b1..Low-Power mode
 */
#define DAC_STATCTRL_LPEN(x)                     (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_LPEN_SHIFT)) & DAC_STATCTRL_LPEN_MASK)
#define DAC_STATCTRL_DACSWTRG_MASK               (0x1000U)
#define DAC_STATCTRL_DACSWTRG_SHIFT              (12U)
/*! DACSWTRG - DAC Software Trigger
 *  0b0..The DAC soft trigger is not valid.
 *  0b1..The DAC soft trigger is valid.
 */
#define DAC_STATCTRL_DACSWTRG(x)                 (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACSWTRG_SHIFT)) & DAC_STATCTRL_DACSWTRG_MASK)
#define DAC_STATCTRL_DACTRGSEL_MASK              (0x2000U)
#define DAC_STATCTRL_DACTRGSEL_SHIFT             (13U)
/*! DACTRGSEL - DAC Trigger Select
 *  0b0..The DAC hardware trigger is selected.
 *  0b1..The DAC software trigger is selected.
 */
#define DAC_STATCTRL_DACTRGSEL(x)                (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACTRGSEL_SHIFT)) & DAC_STATCTRL_DACTRGSEL_MASK)
#define DAC_STATCTRL_DACRFS_MASK                 (0x4000U)
#define DAC_STATCTRL_DACRFS_SHIFT                (14U)
/*! DACRFS - DAC Reference Select
 *  0b0..The DAC selects DACREF_1 as the reference voltage.
 *  0b1..The DAC selects DACREF_2 as the reference voltage.
 */
#define DAC_STATCTRL_DACRFS(x)                   (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACRFS_SHIFT)) & DAC_STATCTRL_DACRFS_MASK)
#define DAC_STATCTRL_DACEN_MASK                  (0x8000U)
#define DAC_STATCTRL_DACEN_SHIFT                 (15U)
/*! DACEN - DAC Enable
 *  0b0..The DAC system is disabled.
 *  0b1..The DAC system is enabled.
 */
#define DAC_STATCTRL_DACEN(x)                    (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACEN_SHIFT)) & DAC_STATCTRL_DACEN_MASK)
#define DAC_STATCTRL_DACBFEN_MASK                (0x10000U)
#define DAC_STATCTRL_DACBFEN_SHIFT               (16U)
/*! DACBFEN - DAC Buffer Enable
 *  0b0..Buffer read pointer is disabled. The converted data is always the first word of the buffer.
 *  0b1..Buffer read pointer is enabled. The converted data is the word that the read pointer points to. It means converted data can be from any word of the buffer.
 */
#define DAC_STATCTRL_DACBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFEN_SHIFT)) & DAC_STATCTRL_DACBFEN_MASK)
#define DAC_STATCTRL_DACBFMD_MASK                (0x60000U)
#define DAC_STATCTRL_DACBFMD_SHIFT               (17U)
/*! DACBFMD - DAC Buffer Work Mode Select
 *  0b00..Normal mode
 *  0b01..Swing mode
 *  0b10..One-Time Scan mode
 *  0b11..FIFO mode
 */
#define DAC_STATCTRL_DACBFMD(x)                  (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFMD_SHIFT)) & DAC_STATCTRL_DACBFMD_MASK)
#define DAC_STATCTRL_DACBFWM_MASK                (0x180000U)
#define DAC_STATCTRL_DACBFWM_SHIFT               (19U)
/*! DACBFWM - DAC Buffer Watermark Select
 *  0b00..In normal mode, 1 word . In FIFO mode, 2 or less than 2 data remaining in FIFO will set watermark status bit.
 *  0b01..In normal mode, 2 words . In FIFO mode, Max/4 or less than Max/4 data remaining in FIFO will set watermark status bit.
 *  0b10..In normal mode, 3 words . In FIFO mode, Max/2 or less than Max/2 data remaining in FIFO will set watermark status bit.
 *  0b11..In normal mode, 4 words . In FIFO mode, Max-2 or less than Max-2 data remaining in FIFO will set watermark status bit. Max is equal to the FIFO depth.
 */
#define DAC_STATCTRL_DACBFWM(x)                  (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFWM_SHIFT)) & DAC_STATCTRL_DACBFWM_MASK)
#define DAC_STATCTRL_TESTOUTEN_MASK              (0x200000U)
#define DAC_STATCTRL_TESTOUTEN_SHIFT             (21U)
/*! TESTOUTEN - DAC test output enable
 *  0b0..Disable DAC test output
 *  0b1..Enable DAC test output
 */
#define DAC_STATCTRL_TESTOUTEN(x)                (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_TESTOUTEN_SHIFT)) & DAC_STATCTRL_TESTOUTEN_MASK)
#define DAC_STATCTRL_BFOUTEN_MASK                (0x400000U)
#define DAC_STATCTRL_BFOUTEN_SHIFT               (22U)
/*! BFOUTEN - DAC output buffer enable
 *  0b0..Disable DAC output buffer
 *  0b1..Enable DAC output buffer
 */
#define DAC_STATCTRL_BFOUTEN(x)                  (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_BFOUTEN_SHIFT)) & DAC_STATCTRL_BFOUTEN_MASK)
#define DAC_STATCTRL_DMAEN_MASK                  (0x800000U)
#define DAC_STATCTRL_DMAEN_SHIFT                 (23U)
/*! DMAEN - DMA Enable Select
 *  0b0..DMA is disabled.
 *  0b1..DMA is enabled. When DMA is enabled, the DMA request will be generated by original interrupts. The interrupts will not be presented on this module at the same time.
 */
#define DAC_STATCTRL_DMAEN(x)                    (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DMAEN_SHIFT)) & DAC_STATCTRL_DMAEN_MASK)
#define DAC_STATCTRL_DACBFUP_MASK                (0xF000000U)
#define DAC_STATCTRL_DACBFUP_SHIFT               (24U)
#define DAC_STATCTRL_DACBFUP(x)                  (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFUP_SHIFT)) & DAC_STATCTRL_DACBFUP_MASK)
#define DAC_STATCTRL_DACBFRP_MASK                (0xF0000000U)
#define DAC_STATCTRL_DACBFRP_SHIFT               (28U)
#define DAC_STATCTRL_DACBFRP(x)                  (((uint32_t)(((uint32_t)(x)) << DAC_STATCTRL_DACBFRP_SHIFT)) & DAC_STATCTRL_DACBFRP_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group DAC_Register_Masks */


/* DAC - Peripheral instance base addresses */
/** Peripheral DAC0 base address */
#define DAC0_BASE                                (0x4003F000u)
/** Peripheral DAC0 base pointer */
#define DAC0                                     ((DAC_Type *)DAC0_BASE)
/** Array initializer of DAC peripheral base addresses */
#define DAC_BASE_ADDRS                           { DAC0_BASE }
/** Array initializer of DAC peripheral base pointers */
#define DAC_BASE_PTRS                            { DAC0 }
/** Interrupt vectors for the DAC peripheral type */
#define DAC_IRQS                                 { DAC0_IRQn }

/*!
 * @}
 */ /* end of group DAC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */

/** DMA - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< Control Register, offset: 0x0 */
  __I  uint32_t ES;                                /**< Error Status Register, offset: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t ERQ;                               /**< Enable Request Register, offset: 0xC */
       uint8_t RESERVED_1[4];
  __IO uint32_t EEI;                               /**< Enable Error Interrupt Register, offset: 0x14 */
  __O  uint8_t CEEI;                               /**< Clear Enable Error Interrupt Register, offset: 0x18 */
  __O  uint8_t SEEI;                               /**< Set Enable Error Interrupt Register, offset: 0x19 */
  __O  uint8_t CERQ;                               /**< Clear Enable Request Register, offset: 0x1A */
  __O  uint8_t SERQ;                               /**< Set Enable Request Register, offset: 0x1B */
  __O  uint8_t CDNE;                               /**< Clear DONE Status Bit Register, offset: 0x1C */
  __O  uint8_t SSRT;                               /**< Set START Bit Register, offset: 0x1D */
  __O  uint8_t CERR;                               /**< Clear Error Register, offset: 0x1E */
  __O  uint8_t CINT;                               /**< Clear Interrupt Request Register, offset: 0x1F */
       uint8_t RESERVED_2[4];
  __IO uint32_t INT;                               /**< Interrupt Request Register, offset: 0x24 */
       uint8_t RESERVED_3[4];
  __IO uint32_t ERR;                               /**< Error Register, offset: 0x2C */
       uint8_t RESERVED_4[4];
  __I  uint32_t HRS;                               /**< Hardware Request Status Register, offset: 0x34 */
       uint8_t RESERVED_5[12];
  __IO uint32_t EARS;                              /**< Enable Asynchronous Request in Stop Register, offset: 0x44 */
       uint8_t RESERVED_6[184];
  __IO uint8_t DCHPRI3;                            /**< Channel n Priority Register, offset: 0x100 */
  __IO uint8_t DCHPRI2;                            /**< Channel n Priority Register, offset: 0x101 */
  __IO uint8_t DCHPRI1;                            /**< Channel n Priority Register, offset: 0x102 */
  __IO uint8_t DCHPRI0;                            /**< Channel n Priority Register, offset: 0x103 */
  __IO uint8_t DCHPRI7;                            /**< Channel n Priority Register, offset: 0x104 */
  __IO uint8_t DCHPRI6;                            /**< Channel n Priority Register, offset: 0x105 */
  __IO uint8_t DCHPRI5;                            /**< Channel n Priority Register, offset: 0x106 */
  __IO uint8_t DCHPRI4;                            /**< Channel n Priority Register, offset: 0x107 */
  __IO uint8_t DCHPRI11;                           /**< Channel n Priority Register, offset: 0x108 */
  __IO uint8_t DCHPRI10;                           /**< Channel n Priority Register, offset: 0x109 */
  __IO uint8_t DCHPRI9;                            /**< Channel n Priority Register, offset: 0x10A */
  __IO uint8_t DCHPRI8;                            /**< Channel n Priority Register, offset: 0x10B */
  __IO uint8_t DCHPRI15;                           /**< Channel n Priority Register, offset: 0x10C */
  __IO uint8_t DCHPRI14;                           /**< Channel n Priority Register, offset: 0x10D */
  __IO uint8_t DCHPRI13;                           /**< Channel n Priority Register, offset: 0x10E */
  __IO uint8_t DCHPRI12;                           /**< Channel n Priority Register, offset: 0x10F */
       uint8_t RESERVED_7[3824];
  struct {                                         /* offset: 0x1000, array step: 0x20 */
    __IO uint32_t SADDR;                             /**< TCD Source Address, array offset: 0x1000, array step: 0x20 */
    __IO uint16_t SOFF;                              /**< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20 */
    __IO uint16_t ATTR;                              /**< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20 */
    union {                                          /* offset: 0x1008, array step: 0x20 */
      __IO uint32_t NBYTES_MLNO;                       /**< TCD Minor Byte Count (Minor Loop Mapping Disabled), array offset: 0x1008, array step: 0x20 */
      __IO uint32_t NBYTES_MLOFFNO;                    /**< TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled), array offset: 0x1008, array step: 0x20 */
      __IO uint32_t NBYTES_MLOFFYES;                   /**< TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled), array offset: 0x1008, array step: 0x20 */
    };
    __IO uint32_t SLAST;                             /**< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20 */
    __IO uint32_t DADDR;                             /**< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
    __IO uint16_t DOFF;                              /**< TCD Signed Destination Address Offset, array offset: 0x1014, array step: 0x20 */
    union {                                          /* offset: 0x1016, array step: 0x20 */
      __IO uint16_t CITER_ELINKNO;                     /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x1016, array step: 0x20 */
      __IO uint16_t CITER_ELINKYES;                    /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x1016, array step: 0x20 */
    };
    __IO uint32_t DLAST_SGA;                         /**< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset: 0x1018, array step: 0x20 */
    __IO uint16_t CSR;                               /**< TCD Control and Status, array offset: 0x101C, array step: 0x20 */
    union {                                          /* offset: 0x101E, array step: 0x20 */
      __IO uint16_t BITER_ELINKNO;                     /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x101E, array step: 0x20 */
      __IO uint16_t BITER_ELINKYES;                    /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x101E, array step: 0x20 */
    };
  } TCD[16];
} DMA_Type;

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

